base/Catalogs/бит_СчетаБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_СчетаБюджета</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_Бюджеты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Comment>Счет</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Бюджетирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование элемента справочника для вывода на печать</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>Коэффициент</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодификатор</Name>
					<Comment>Произвольный код. Используется для вывода в отчетах и печатных формах.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтображать</Name>
					<Comment>Не отображать</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_СчетаБюджета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Процедура копирует счета из бюджета источника в бюджет приемник.
//
// Параметры:
//  Источник - СправочникСсылка.бит_Бюджеты	 - Ссылка на бюджет источник копирования.
//  Приемник - СправочникСсылка.бит_Бюджеты	 - Ссылка на бюджет приемник.
//
Процедура СкопироватьСчета(Источник, Приемник) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Источник);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетаБюджета.Родитель КАК Родитель,
	|	СчетаБюджета.ЭтоГруппа КАК ЭтоГруппа,
	|	СчетаБюджета.Наименование КАК Наименование,
	|	СчетаБюджета.Счет КАК Счет,
	|	СчетаБюджета.НаименованиеПолное КАК НаименованиеПолное,
	|	СчетаБюджета.Коэффициент КАК Коэффициент,
	|	СчетаБюджета.Кодификатор КАК Кодификатор,
	|	СчетаБюджета.НеОтображать КАК НеОтображать,
	|	СчетаБюджета.Комментарий КАК Комментарий,
	|	СчетаБюджета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_СчетаБюджета КАК СчетаБюджета
	|ГДЕ
	|	СчетаБюджета.Владелец = &Владелец
	|	И НЕ СчетаБюджета.ПометкаУдаления";
	Результа = Запрос.Выполнить();
	
	РодителиЭлементов = Новый Соответствие();
	РодителиЭлементов.Вставить(Справочники.бит_СчетаБюджета.ПустаяСсылка(), Справочники.бит_СчетаБюджета.ПустаяСсылка()); 
	Выборка = Результа.Выбрать();
	
	НачатьТранзакцию();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоГруппа Тогда
			ИсключенныеСвойства = "НаименованиеПолное, НеОтображать, Комментарий, Ссылка, Счет";
			НовыйСчет = Справочники.бит_СчетаБюджета.СоздатьГруппу();
		Иначе 	
			ИсключенныеСвойства = "Ссылка";
			НовыйСчет = Справочники.бит_СчетаБюджета.СоздатьЭлемент();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НовыйСчет, Выборка,, ИсключенныеСвойства);
		НовыйСчет.Владелец = Приемник;
		
		Если ЗначениеЗаполнено(Выборка.Родитель) Тогда
			КопияРодитель = РодителиЭлементов.Получить(Выборка.Родитель);
			Если КопияРодитель = Неопределено Тогда
				КопияРодитель = Справочники.бит_СчетаБюджета.ПолучитьСсылку();
				РодителиЭлементов.Вставить(Выборка.Родитель, КопияРодитель);
			КонецЕсли;	
			НовыйСчет.Родитель = КопияРодитель;
		КонецЕсли;
		
		Если Выборка.ЭтоГруппа Тогда
			НоваяСсылка = РодителиЭлементов.Получить(Выборка.Ссылка);
			Если НоваяСсылка = Неопределено Тогда
				НоваяСсылка = Справочники.бит_СчетаБюджета.ПолучитьСсылку();
				РодителиЭлементов.Вставить(Выборка.Ссылка, НоваяСсылка);
			КонецЕсли; 
			НовыйСчет.УстановитьСсылкуНового(НоваяСсылка);
		КонецЕсли;
		НовыйСчет.УстановитьНовыйКод();
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НовыйСчет, Истина);
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Не удалось копировать счета бюджета.
										|%1';
						  	      |en = 'Не удалось копировать счета бюджета.
										|%1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())); 
			ВызватьИсключение ТекстСообщения;
		КонецПопытки;
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Проверяется уникальность счета в рамках владельца.
//
// Параметры:
//  Статья	 - СправочникСсылка.бит_СчетаБюджета	 - Проверяемвы счет.
//  Отказ	 - Булево								 - Отменяет стандартную обработку вызывающего обработчика.
//
Процедура СчетаБюджетаУникальный(СчетБюджета, Отказ) Экспорт
	
	РеквизитыСтатьиБюджета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетБюджета, "Владелец,Счет");
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",	СчетБюджета);
	Запрос.УстановитьПараметр("Бюджет",	РеквизитыСтатьиБюджета.Владелец);
	Запрос.УстановитьПараметр("Счет",	РеквизитыСтатьиБюджета.Счет);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СчетаБюджет.Ссылка КАК Ссылка,
	|	СчетаБюджет.Представление КАК Представление
	|ИЗ
	|	Справочник.бит_СчетаБюджета КАК СчетаБюджет
	|ГДЕ
	|	СчетаБюджет.Ссылка <> &Ссылка
	|	И СчетаБюджет.Владелец = &Бюджет
	|	И НЕ СчетаБюджет.ПометкаУдаления
	|	И СчетаБюджет.Счет = &Счет";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ШаблонСообщения = СтрШаблон(НСтр("ru='Дублирование счетов бюджета в рамках одного бюджета не поддерживается. Счет уже используется в счете бюджета ""%1"".';
			|en='Duplication of the budget accounts within the same budget is not supported. Account is already used in the budget account ""%1"".'"), Выборка.Представление);
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ", "КОРРЕКТНОСТЬ", 
			НСтр("ru='Счет';en='Account'"),,,ШаблонСообщения);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
